{
    "gasoline-engine": [
        {
            "title": "High-Performance Power for Demanding Applications",
            "description": "The Bonhoeffer Gasoline Engine is engineered to deliver consistent, high-performance output for a wide range of heavy-duty machines. Whether it's powering a water pump, generator, cultivator, pressure washer, or small construction equipment, this engine is built to work hard, day in and day out.\nWith a focus on durability, easy operation, and smart protection features, this engine offers the perfect balance of strength, efficiency, and reliability."
        },
        {
            "title": "Key Features",
            "description": "1. OHV Engine Technology:\nEquipped with advanced Overhead Valve (OHV) technology, the engine offers smoother performance, efficient fuel consumption, and lower emissions. This design ensures quick starts, reduced heat build-up, and improved torque — even in tough working environments.\n2. Heavy-Duty Application:\nThe Bonhoeffer Gasoline Engine is designed for high-load, extended-use applications. It is compatible with:\nWater pumps,Portable generators,Cultivators and tillers,Stationary sprayers,Pressure washers and Small-scale construction machinery.\nIts robust structure and steady power delivery make it ideal for both mobile and stationary equipment across industrial, agricultural, and utility sectors.\n3. Smart Framed Structure:\nThe engine features a compact but rugged frame that offers stability during operation and protects internal components from external damage. Its design also simplifies installation, making it suitable for integration across various machine platforms.\n4. Built-in Oil Sensor Protection:\nFor added safety and durability, the engine includes a low oil level sensor. This feature automatically shuts off the engine or prevents startup if the oil level drops below safe limits — helping prevent damage and prolong engine life.\n5. Steel Muffler Grille with Enhanced Cooling:\nA protective steel grille covers the muffler, adding durability and shielding it from debris or impact. In addition, this design enhances airflow and cooling efficiency, especially during long operating periods in hot or dusty environments." 
        },
        {
            "title": "Performance & Usability",
            "description": "Reliable Starting: Easy manual start system, designed for quick ignition even in cold or variable conditions.\nLow Maintenance: Engine components are engineered for longevity, with minimal service requirements.\nFuel Efficiency: Delivers high output without excessive fuel consumption, making it cost-effective for regular use.\nLow Vibration & Noise: Operates with reduced vibration for smoother use and better operator comfort."
        },
        {
            "title": "Applications",
            "description": "The Bonhoeffer Gasoline Engine is ideal for:\nAgricultural equipment,Light construction tools,Industrial sprayers and washers,Emergency power systems and Portable utility machines.\nIts versatility makes it a go-to solution for professionals who need dependable power across multiple use cases."
        },
        {
            "title": "Summary",
            "description": "The Bonhoeffer Gasoline Engine is a powerful and durable solution for anyone needing a compact, fuel-efficient engine capable of handling demanding jobs. With OHV technology, integrated protection features, and a structure built for the real world, it offers performance you can count on — whether in the field, on-site, or off the grid."
        }
    ],
    "gasoline-water-pump": [
        {
            "title": "Because When the Job's Tough, You Need Something Tougher",
            "description": "There's nothing quite like being caught in the middle of a job and realizing your equipment just can't keep up. Whether you're knee-deep in muddy water at a construction site, racing to water your crops before the heat sets in, or trying to clear out a flooded basement before damage sets in — you need gear you can trust.\nThat's exactly where the Bonhoeffer Gasoline Water Pump comes in.\nBuilt for people who work hard and don't have time for failure, this machine is designed to move water fast, reliably, and without any drama. No fancy bells and whistles — just a solid, powerful pump that shows up, starts up, and gets to work."
        },
        {
            "title": "A Powerful Engine That Just Keeps Going",
            "description": "At the heart of this pump is a rugged OHV engine that delivers consistent performance, even in the toughest conditions. It's quick to start — which matters when time's against you — and runs smoothly for hours. Whether you're out in the field with no access to electricity or working late into the evening, this engine keeps powering through.\nIt doesn't waste fuel, either. It's efficient, dependable, and made to handle jobs big and small without breaking a sweat."
        },
        {
            "title": "Surprisingly Portable, Seriously Tough",
            "description": "You might expect something this strong to be bulky and hard to move. It's not. Thanks to its lightweight aluminum pump housing, this machine is easy to carry, load into a truck, or haul across a job site. One person can handle it — no extra hands needed.\nAt the same time, the aluminum body means you don't have to worry about rust or weather damage. It holds up well, rain or shine, and shrugs off the wear and tear of daily use."
        },
        {
            "title": "Made for Dirty Water and Dirty Jobs",
            "description": "Let's be honest — water on job sites is rarely clean. That's why we designed this pump with a ceramic cylinder that resists wear and a double forged crankshaft arm to keep things running smoothly, even when debris tries to slow you down.\nThe whole system is built to last — fewer breakdowns, less maintenance, and more time getting the job done."
        },
        {
            "title": "Comfort You'll Notice",
            "description": "If you've ever used a water pump that rattles your arms for hours, you'll love the low-vibration design on this one. It's smooth, quiet, and easy on your hands — even during long sessions. Small touches like that make a big difference when the work piles up."
        },
        {
            "title": "Who It's For",
            "description": "Farmers needing fast, portable irrigation\nBuilders and contractors clearing water on site\nHomeowners dealing with basement flooding\nDisaster response teams who need fast, mobile water removal\nAnyone working where there's no power outlet in sight"
        },
        {
            "title": "Simple. Reliable. Ready When You Are.",
            "description": "We didn't overthink it. We just built it right. The Bonhoeffer Gasoline Water Pump is for the doers — the folks who show up early, stay late, and never let a challenge slow them down.\nIf that sounds like you, then this is your pump.\nYou bring the grit. We bring the gear."
        }
    ],
    
    "gasoline-generator": [
  {
    "title": "Bonhoeffer Gasoline Generators — Power That Follows You Anywhere",
    "description": "Imagine this: the lights flicker, the tools go silent, and everything comes to a standstill. Whether you're out on a farm, halfway through a job at a remote site, or simply trying to keep the house running during a sudden blackout — power matters. And when it matters, you don’t want to take chances.\nThat’s why there’s Bonhoeffer.\nOur gasoline generators aren’t just backup equipment. They’re your power partner — rugged, reliable, and always ready to step up when everything else shuts down."
  },
  {
    "title": "Built Tough. Runs Smooth.",
    "description": "What makes Bonhoeffer stand apart? It starts with the engine — a professional-grade gasoline engine that’s as steady as they come. It fires up easily, keeps its cool under load, and runs like a workhorse, hour after hour. Whether you’re powering drills, lights, pumps, or the essentials in your home, this generator won’t skip a beat.\nAnd because performance is only as good as the parts behind it, we don’t cut corners. 100% copper winding alternators ensure superior efficiency, consistent voltage output, and long-lasting durability. You get stable, clean power — the kind your equipment (and your peace of mind) depends on."
  },
  {
    "title": "Steel Frame, Built Like a Tank",
    "description": "Out in the real world, conditions aren’t always gentle. That’s why our generators are housed in tough, Q235-grade steel frames — the kind used in construction and industrial applications. Welded using automated robotic technology, these frames offer precision strength and stability. No rattles. No wobbles. Just a solid foundation that holds up — no matter where you take it."
  },
  {
    "title": "Control at Your Fingertips",
    "description": "No one wants to fumble with confusing buttons when the lights are out. That’s why Bonhoeffer’s integrated graphical control panel is designed to be effortless. Everything is laid out clearly — voltage indicators, power outlets, fuel status — so you can operate it confidently, even if it’s your first time using a generator."
  },
  {
    "title": "Handles Everything You Throw at It",
    "description": "Heavy tools? Household appliances? Emergency lighting systems? Bonhoeffer handles them all. These generators are built for varied load conditions, with inbuilt automatic voltage regulation (AVR) and overload protection, keeping both your devices and the generator safe.\nSo whether you're powering a workshop or keeping the fridge and fans running during a summer power cut, it adapts and delivers without hesitation."
  },
  {
    "title": "Safety Comes Standard",
    "description": "Every Bonhoeffer generator is equipped with essential safety features:\n- Low oil sensors to prevent engine damage\n- Thermal overload protection\n- Secure grounding and shielded mufflers for added safety\nThese aren’t optional — they’re part of the promise that your power will always be safe, smart, and dependable."
  },
  {
    "title": "Portable Power, No Strings Attached",
    "description": "You don’t stay in one place — and neither should your generator. Bonhoeffer models are compact, easy to store, and available with wheel kits and foldable handles for easy transport. From home to field to workshop, your power goes wherever you go."
  },
  {
    "title": "The Bottom Line?",
    "description": "When you choose Bonhoeffer, you’re not just buying a generator.\nYou’re investing in confidence — that when the lights go out, your world keeps moving.\nYou’re choosing control — power that’s yours, anywhere, anytime.\nYou’re getting performance — smart engineering, sturdy construction, and no-nonsense reliability.\nBonhoeffer Gasoline Generators — Because when power is non-negotiable, you deserve one that won’t let you down."
  }
],
    
    "gasoline-inverter": [
  {
    "title": "Gasoline Inverter — Quiet, Portable Power with a Purpose",
    "description": "Picture this: you’re off the grid, the night is quiet, and your equipment needs power. Or perhaps it’s a sudden power outage at home, and everything from your phone to your fridge is down. That’s when every second matters — and every watt counts.\nThat’s when the Bonhoeffer Gasoline Inverter steps in.\nMore than just a power source, it’s your quiet companion — engineered for performance, built for movement, and trusted when silence and stability matter most."
  },
  {
    "title": "Whisper-Quiet. Fully Capable.",
    "description": "One of the most noticeable things about Bonhoeffer’s inverter is what you don’t notice — the noise. Designed with ultra-quiet technology, it hums in the background without disrupting conversations, sleep, or the sounds of nature. Perfect for homes, campsites, workstations, and anywhere silence is golden.\nIts core is a 4-stroke gasoline engine, known for smooth running and fuel efficiency. It starts easily, stays cool under pressure, and runs clean — producing stable power safe enough for sensitive electronics like laptops, routers, cameras, and medical equipment."
  },
  {
    "title": "Built for Real-World Conditions",
    "description": "The Bonhoeffer inverter isn’t just about indoor convenience — it’s made for the outdoors, too. With performance guaranteed across a wide temperature range (-5°C to 50°C), it works just as well in freezing hillsides as it does in blazing summer heat.\nUneven ground? No worries. Thanks to its 25° tilt tolerance in all directions, the inverter keeps running even when placed on sloped surfaces, gravel patches, or uneven terrain."
  },
  {
    "title": "Power That Moves With You",
    "description": "Designed with portability at its core, this inverter is lightweight, compact, and easy to carry. The use of high-quality plastic resin body components cuts down weight without compromising durability. Whether you’re moving it around the garden, loading it in a car, or packing it for an off-grid adventure — it travels light and works hard.\nOptional wheel kits and folding handles make transport even more effortless."
  },
  {
    "title": "Efficiency You Can Count On",
    "description": "Every drop of fuel counts, and Bonhoeffer ensures you get the most out of it. The inverter is built to make full use of petrol, extending runtime and reducing refills. This fuel-smart design means you stay powered longer, especially when fuel access is limited or you’re away from civilization."
  },
  {
    "title": "Safe. Simple. Smart.",
    "description": "Operating the Bonhoeffer inverter is easy, even for first-time users. The user-friendly control panel displays all vital stats clearly — power output, fuel level, and system alerts — so you stay in control with just a glance.\nSafety is part of the system. The inverter includes:\n- Overload protection to guard your devices\n- Low oil shutdown to protect the engine\n- Heat-resistant design for extended operation\nThese features work quietly in the background, ensuring safety without adding complexity."
  },
  {
    "title": "The Bonhoeffer Promise",
    "description": "When you choose a Bonhoeffer Gasoline Inverter, you’re choosing more than just portable electricity.\nYou’re choosing quiet confidence — power that performs without the noise.\nYou’re choosing mobility — energy that goes where you go.\nYou’re choosing engineering that endures — crafted for real-world use, not just perfect conditions.\nBonhoeffer Gasoline Inverter — For Power That Never Feels Like a Burden.\nBecause when the world goes dark, this is the light, the charge, and the quiet force you can rely on."
  }
],
    
   "gasoline-tiller": [
  {
    "title": "Gasoline Tiller – Rugged Power for Every Patch of Land",
    "description": "The Bonhoeffer Gasoline Tiller is built for those who expect more from their equipment — more power, more durability, and more versatility. Whether you're preparing garden beds, loosening compact soil, or working through wet and muddy patches, this machine is designed to deliver high performance with low effort."
  },
  {
    "title": "Strong and Steady Gasoline Engine",
    "description": "At the core of this tiller is a powerful Bonhoeffer gasoline engine that delivers reliable output even during long hours of operation. It starts easily and runs smoothly, providing the torque needed to handle challenging soils without hesitation. Fitted with an oil bath air filter, the engine stays protected in dusty and dry field conditions, extending its life and reducing wear. This makes it an excellent fit for farms, fields, and gardens where fine dust and loose debris are part of the job."
  },
  {
    "title": "Fully Sealed Transmission – Built for Wet Work",
    "description": "Not all work happens in dry soil. That’s why the Bonhoeffer tiller features a sealed transmission system that’s ready for wet and muddy conditions. Whether you're working in paddy fields, vegetable plots, or damp garden beds, the sealed design keeps moisture out and performance in. The direct clutch mechanism ensures smooth engagement and reliable control, offering two forward speeds and one reverse to help you adjust pace and depth with precision."
  },
  {
    "title": "Adjustable Handlebar – Comfort in Your Hands",
    "description": "Comfort and control go hand in hand. The tiller is fitted with a fully adjustable handlebar, which can be set both horizontally and vertically to match the operator’s height and field conditions. This helps reduce fatigue during extended use and allows for better maneuverability around tight corners, tree beds, and raised rows."
  },
  {
    "title": "Removable Transport Wheels – Ready to Roll",
    "description": "Standard removable wheels make it easy to move the tiller from storage to field without dragging or lifting. Once you reach your working area, the wheels can be removed quickly, letting the machine dig in with full traction and effectiveness."
  },
  {
    "title": "AUX PTO – One Machine, Many Tools",
    "description": "The Auxiliary Power Take-Off (AUX PTO) adds real versatility to this tiller. It allows you to connect a wide range of implements like ploughs, ridgers, ditching blades, and more. This transforms the tiller into a multi-functional powerhouse — saving time, space, and the need for multiple machines."
  },
  {
    "title": "Durable and Field-Ready",
    "description": "Every component is built to handle the harsh realities of farm and field work. From the reinforced chassis to the corrosion-resistant housing, this tiller is made for regular, heavy-duty use. It’s built to stay stable under load, perform in demanding soil types, and operate across different terrains with ease."
  },
  {
    "title": "Summary",
    "description": "The Bonhoeffer Gasoline Tiller combines high-performance engineering, user-friendly design, and true adaptability. It’s a go-to solution for landowners, small-scale farmers, and professionals who need a machine that works as hard as they do — in dry soil, wet patches, or anywhere in between."
  }
],
    
    "efi-gasoline-engine": [
  {
    "title": "EFI Gasoline Engine — Where Smart Technology Meets Reliable Power",
    "description": "The Bonhoeffer EFI Gasoline Engine is the perfect combination of modern precision and rugged dependability. Built for performance, it’s designed to power through demanding tasks while keeping fuel use efficient, starts easy, and performance steady — all thanks to advanced Electronic Fuel Injection (EFI).\nWhether it’s working on agricultural equipment, running a pressure washer, or powering a generator in tough environments, this engine is built to handle it all without hesitation."
  },
  {
    "title": "Smarter Fuel Delivery",
    "description": "At the core of the engine is an intelligent EFI system. Instead of relying on outdated carburetors, EFI technology delivers fuel exactly when and where it's needed. The result? Consistent combustion, reduced fuel waste, and responsive power that adjusts automatically to the job at hand. No matter the altitude, load, or weather, the engine responds smoothly — with no tuning or fuss."
  },
  {
    "title": "Fuel Efficiency You Can Rely On",
    "description": "The Bonhoeffer EFI engine helps save on fuel without compromising performance. Its smart system adapts in real-time, using only as much fuel as the task demands. Whether it’s idling or under full load, it optimizes every drop of petrol — keeping costs down and run-time up."
  },
  {
    "title": "Quick, Confident Starts – Every Time",
    "description": "Forget choke levers, flooding, or hard cranking. The EFI system ensures easy starting in any condition, from early-morning chill to mid-day heat. The engine’s smart controls manage fuel flow automatically, so you can start work without delay — no frustration, no second tries."
  },
  {
    "title": "Steady Output. Smooth Operation.",
    "description": "Even under changing loads or demanding tools, this engine delivers stable RPM and clean power. That makes it ideal for machinery that can’t afford performance dips — like sprayers, tillers, compressors, or industrial washers. You get reliability without interruption."
  },
  {
    "title": "Low Maintenance, Long Life",
    "description": "Built with quality materials and tested in real-world conditions, the Bonhoeffer EFI Gasoline Engine is made to last. The absence of a carburetor means fewer parts to clean, adjust, or replace. Internal components are designed to resist wear, and the cooling system keeps things running at the right temperature, even during long operating hours.\nIt’s an engine you can count on, season after season, with less downtime and fewer service calls."
  },
  {
    "title": "Versatile and Application-Ready",
    "description": "This engine isn’t just strong — it’s versatile. It’s suitable for a wide range of uses, including:\nAgricultural sprayers and tillers\nWater pumps\nPortable generators\nPressure washers\nConstruction and industrial equipment\nIt’s available in both electric-start and recoil-start options, with shaft configurations compatible across most machinery platforms."
  },
  {
    "title": "Cleaner Performance. Quieter Operation.",
    "description": "Thanks to more efficient combustion, this engine produces fewer emissions and operates more smoothly than traditional carbureted models. That means less environmental impact, cleaner exhaust, and a better experience for users and bystanders alike."
  },
  {
    "title": "Conclusion",
    "description": "The Bonhoeffer EFI Gasoline Engine brings advanced technology, real-world durability, and practical efficiency together in one powerful package. It’s the engine of choice for professionals who want smarter performance, lower fuel costs, and dependable results — no matter the task.\nBonhoeffer EFI Gasoline Engine — Engineered to Think. Built to Work."
  }
],
    "brush-cutter": [
  {
    "title": "Brush Cutter — Precision Power for Everyday Outdoor Tasks",
    "description": "The Bonhoeffer Brush Cutter is built to handle the rough and the overgrown — whether it’s thick grass, wild undergrowth, tall weeds, or dense shrubs. Designed for consistent performance and long-term durability, this machine makes clearing land, trimming edges, and managing wild vegetation not just easier, but far more efficient.\nPerfect for agricultural workers, gardeners, landscapers, or anyone maintaining large outdoor areas, the Bonhoeffer Brush Cutter delivers more cutting power, better control, and greater comfort — all in one well-balanced tool."
  },
  {
    "title": "Powerful Engine Performance",
    "description": "At the core of the brush cutter is a 30% more powerful engine than traditional models in its class. This added power makes a noticeable difference, especially when working through dense brush or uneven terrain. The high-displacement engine is designed to generate greater torque, helping the blade cut through tough vegetation with minimal resistance or strain on the motor.\nThis means faster cutting, less effort, and better results in less time — even across demanding work environments."
  },
  {
    "title": "Durable Engine Construction",
    "description": "The engine isn’t just powerful; it’s made for the long haul. It’s built with a 20 CRMO material crankshaft, known for its strength, durability, and resistance to wear under continuous load. This premium-grade alloy material ensures a longer service life, reduced vibration, and more reliable performance during extended use.\nIt’s an ideal choice for users who need a machine that won’t quit after a single season of hard work."
  },
  {
    "title": "200-Hour Tested Gearbox",
    "description": "The professional-grade gearbox has undergone 200 hours of endurance testing, ensuring reliable transmission of power from the engine to the blade with minimal wear. This gearbox allows for smooth operation and steady torque output, even under variable loads and frequent use.\nIt’s engineered for stability and balance, helping maintain cutting precision throughout the task."
  },
  {
    "title": "Ergonomic Handle Design",
    "description": "For comfort and control, the Bonhoeffer Brush Cutter is fitted with a bicycle-style handlebar. This ergonomic design reduces fatigue and allows for better balance and maneuverability, especially over long working sessions. The handle offers a natural grip position, giving the operator more precise control while reducing strain on the shoulders and wrists.\nWhether you're cutting close to the ground or reaching around tight corners, this handle layout supports more effective movement and positioning."
  },
  {
    "title": "Compact, Lightweight, and User-Friendly",
    "description": "Despite its power and rugged build, the brush cutter is lightweight and compact, making it easy to carry, use, and store. It’s compatible with a range of attachments, so you can tailor it to suit various outdoor needs — from cutting tall grass to clearing small branches and tough weeds.\nThe design prioritizes user comfort, with minimal vibration and simplified controls for easy operation, even for those new to brush cutters."
  },
  {
    "title": "Reliable Performance, Day After Day",
    "description": "Every component of the Bonhoeffer Brush Cutter is engineered with performance and longevity in mind. From the reinforced engine internals to the smooth, responsive gear system, it’s built to withstand tough jobs and regular use. Maintenance is straightforward, and replacement parts are easy to access, making it a machine you can depend on year after year."
  },
  {
    "title": "Summary",
    "description": "The Bonhoeffer Brush Cutter combines powerful engine performance, durable construction, and ergonomic handling in a machine built to tackle outdoor cutting tasks with ease. With 30% more engine power, a 20 CRMO crankshaft, and a 200-hour tested gearbox, it offers unmatched efficiency, reliability, and operator comfort.\nBonhoeffer Brush Cutter — Built Strong. Designed Smart. Made for Every Cut."
  }
],
    
"backpack-brush-cutter": [
  {
    "title": "Power, Comfort, and Durability in Every Step",
    "description": "The Bonhoeffer Backpack Brush Cutter is designed for users who need extended cutting performance without compromising on mobility and comfort. Built to take on tough clearing jobs across fields, farms, hillsides, or uneven terrain, this brush cutter is engineered with professional-grade components and a thoughtfully designed backpack harness system — making it easier to carry, easier to use, and much more effective in operation."
  },
  {
    "title": "Backpack Design for Maximum Mobility",
    "description": "Unlike conventional models, this brush cutter features a back-mounted engine assembly, significantly reducing the weight on your arms and hands. The high-quality harness system distributes weight evenly across your shoulders and back, minimizing fatigue during long hours of use. This design allows for better maneuverability in tight or sloped areas and is especially helpful for users who need to cover large areas or navigate challenging terrain.\nThe backpack frame is made of durable steel, offering a stable and secure mount for the engine while ensuring rugged field durability. Whether you're working on dry land or moving through dense undergrowth, the backpack system adds both comfort and control."
  },
  {
    "title": "30% More Powerful Engine",
    "description": "At the heart of the Bonhoeffer Backpack Brush Cutter is a high-performance gasoline engine delivering 30% more power compared to traditional models. This extra torque and cutting force makes light work of thick grass, woody weeds, and stubborn underbrush. The engine’s high output allows for faster cutting, better blade momentum, and improved productivity — especially in jobs that demand long operation or repeated clearing."
  },
  {
    "title": "Engineered for Reliability and Long Service Life",
    "description": "The internal components of the engine are built to last. It features a 20 CRMO crankshaft — a hardened alloy known for its strength, heat resistance, and superior durability. This material choice reduces wear under load and extends the working life of the engine, making it a dependable choice for both occasional use and continuous operation.\nTo ensure maximum transmission efficiency, the unit is equipped with a professional-grade gearbox that’s been tested for 200 continuous operating hours. This gearbox ensures consistent power delivery from engine to blade, providing smooth operation and minimal vibration during use. The result is better blade stability, longer tool life, and reduced operator strain."
  },
  {
    "title": "Comfort and Handling",
    "description": "In addition to its backpack support, the cutter head features a loop handle or bicycle-style grip (depending on configuration), allowing for accurate control and easy adjustment while trimming or clearing. The tool shaft is flexible and responsive, designed to transfer engine power without lag or drag.\nThe harness is padded and adjustable, ensuring a secure fit for different body types and working positions. This helps maintain posture and comfort, even during extended tasks in the sun or on difficult terrain."
  },
  {
    "title": "Built to Tackle the Outdoors",
    "description": "Whether clearing fence lines, trimming uneven terrain, or maintaining orchard grounds, the Bonhoeffer Backpack Brush Cutter delivers professional-grade results. It’s suited for agricultural use, forest maintenance, roadside clearing, and commercial landscaping, offering excellent durability and all-day performance."
  },
  {
    "title": "Summary",
    "description": "The Bonhoeffer Backpack Brush Cutter combines advanced engine technology, ergonomic design, and tested durability into one high-performance tool. With its powerful engine, rugged steel frame, long-life crankshaft, and comfortable harness, it’s built for those who want serious performance with maximum mobility.\nBonhoeffer Backpack Brush Cutter — Strong on Power. Easy on Your Back. Built to Keep Going."
  }
], "multi-tool": [
  {
    "title": "One Engine, Endless Possibilities",
    "description": "The Bonhoeffer Multi-Tool is a compact and powerful solution for those who need versatility in outdoor maintenance without the clutter of multiple machines. Whether you're trimming long grass, pruning tall branches, shaping hedges, or clearing overgrowth, this tool does it all — with one engine and a range of easy-to-attach accessories. Built with durable components and powered by advanced engine technology, it’s designed for professionals, landscapers, and homeowners who value performance, efficiency, and simplicity."
  },
  {
    "title": "Smart Engine, Strong Performance",
    "description": "At the heart of the Bonhoeffer Multi-Tool is a digitally intelligent engine that delivers 30% more power than standard units in its segment. This added output ensures smooth operation, even when handling heavier attachments like the pole pruner or brush blade. The digital engine system is designed to optimize fuel-air mixture, boost combustion efficiency, and maintain steady power through varied loads and working conditions.\nWhether trimming soft hedges or slicing through dense growth, the engine responds precisely and instantly — no lag, no stalling, just consistent performance."
  },
  {
    "title": "Premium Internal Engineering",
    "description": "The engine isn’t just powerful — it’s made to last. Inside, it features a 20 CRMO crankshaft, a highly durable alloy known for its toughness, wear resistance, and stability under stress. This crankshaft supports smoother engine movement, reduces internal friction, and helps extend overall service life — especially in demanding applications.\nThe Nikasil-coated cylinder adds another layer of performance and durability. This nickel-silicon-carbide coating protects the cylinder walls from scoring and wear, increases heat resistance, and enhances lubrication between piston and bore. The result is a longer-lasting engine that performs well even under continuous, high-rev conditions."
  },
  {
    "title": "Heavy-Duty Gearbox",
    "description": "The Bonhoeffer Multi-Tool includes a professional-grade gearbox, designed for reliable torque transmission between the engine and each attachment. Whether you're cutting at high speeds or working at an angle, the gearbox maintains smooth, vibration-free operation. It ensures consistent power flow to each tool head, reducing stress on both the attachment and the user."
  },
  {
    "title": "Multiple Attachments – One Compact System",
    "description": "This tool is a true multi-tasker. With a long, sturdy shaft, the attachments can be connected or removed easily, letting you switch between jobs in minutes without separate equipment. The included accessories are:\nTrimmer Head – Ideal for grass, edges, and light weeds\nBrush Blade – Cuts through denser undergrowth and tough vegetation\nPole Pruner – Reaches high branches for clean, precise pruning\nHedge Trimmer – Helps shape and maintain hedges, even at height\nEach attachment is built with quality materials and designed for both balance and ease of use. The long shaft offers excellent reach without sacrificing control, helping you work safer and more efficiently."
  },
  {
    "title": "Built for Comfort and Control",
    "description": "The handle system is designed for comfort and grip, giving the user better control during operation. The multi-tool is well-balanced, and the quick-lock attachment mechanism allows for secure connections with minimal setup time. Whether you’re working at height, in tight spaces, or over long hours, the ergonomic layout supports user comfort and reduces fatigue."
  },
  {
    "title": "Summary",
    "description": "The Bonhoeffer Multi-Tool combines smart engine technology, high-quality engineering, and versatile attachments into one practical, reliable machine. With its 30% more powerful engine, heavy-duty gearbox, durable crankshaft, and multiple tool heads, it delivers the performance of four machines in one compact system.\nBonhoeffer Multi-Tool – Maximum Utility. Minimal Effort. One Tool for All Tasks."
  }
],
    
    "chainsaw": [
  {
    "title": "Power Meets Precision",
    "description": "The Bonhoeffer Chainsaw is built to handle the toughest cutting tasks with ease — whether it’s felling thick trees, cutting hardwood logs, or preparing firewood. Engineered for power, stability, and accuracy, this machine is designed for professionals, landscapers, and serious users who need consistent performance without compromise.\nWith its high-speed engine, durable build, and precision cutting system, the Bonhoeffer Chainsaw delivers reliable results, cut after cut."
  },
  {
    "title": "High-Speed, High-Efficiency Engine",
    "description": "At the core of the Bonhoeffer Chainsaw is a powerful engine capable of delivering over 13,000 RPM, giving you the speed and torque required to cut through large logs and dense hardwood with confidence. This high output ensures fast cutting with less resistance, especially when working on thick trunks or dried wood.\nDespite its power, the engine is tuned for fuel efficiency, delivering a longer running time between refills. This allows for uninterrupted work, making it ideal for heavy-duty applications such as timber harvesting, land clearing, and professional landscaping."
  },
  {
    "title": "Professional-Grade Guide Bar and Chain",
    "description": "The chainsaw comes fitted with a premium-quality guide bar and saw chain, built for consistent performance and long-term durability. The bar is engineered to reduce friction and support smooth chain rotation, helping the user maintain control while cutting through large-diameter logs.\nThe saw chain is sharpened for precision and speed, helping reduce cutting time and improving output, especially during repetitive tasks. Together, the guide bar and chain work in perfect alignment to ensure straight, stable, and efficient cuts, even in challenging conditions."
  },
  {
    "title": "Stable and Low-Vibration Design",
    "description": "Bonhoeffer places strong emphasis on operator comfort and safety. The chainsaw is designed with a balanced chassis and low-vibration engine mount, which reduces fatigue during extended periods of use. This allows for better control, improved accuracy, and smoother handling — particularly important when working in tight or elevated environments.\nThe vibration-dampening system also helps protect the internal engine parts and lengthens the overall service life of the machine. Whether you’re cutting vertically, horizontally, or at awkward angles, the saw remains steady and responsive."
  },
  {
    "title": "Durability in Demanding Environments",
    "description": "From the engine to the outer housing, every part of the Bonhoeffer Chainsaw is constructed for rugged performance. The components are made from heat- and wear-resistant materials that can withstand high-speed rotation, dust, heat, and the occasional impact. The bar and chain system is easy to maintain and built to hold up over time — reducing the need for frequent replacements or adjustments."
  },
  {
    "title": "Ease of Use and Maintenance",
    "description": "Despite its professional performance level, the chainsaw is user-friendly. It features a smooth recoil starter, easy-access chain tensioning system, and simplified controls for throttle, choke, and stop functions. The air filter and spark plug can be accessed quickly for cleaning or replacement, making routine maintenance fast and efficient."
  },
  {
    "title": "Applications and Use Cases",
    "description": "The Bonhoeffer Chainsaw is suited for:\nCutting firewood and large logs\nTree felling and trimming\nClearing hardwood or thick branches\nProfessional forestry and landscaping work\nIt’s a dependable solution for users who need consistent, long-lasting cutting power in demanding outdoor environments."
  },
  {
    "title": "Summary",
    "description": "With over 13,000 RPM engine speed, a fuel-efficient system, low-vibration construction, and professional-grade components, the Bonhoeffer Chainsaw is made for serious cutting tasks. It offers the perfect balance of raw power and precise control, backed by the reliability and quality Bonhoeffer is known for.\nBonhoeffer Chainsaw – Built for Big Cuts. Engineered for Long Hours. Trusted in the Toughest Conditions."
  }
]


}
