{
    "gasoline-engine": [
        {
            "title": "High-Performance Power for Demanding Applications",
            "description": "The Bonhoeffer Gasoline Engine is engineered to deliver consistent, high-performance output for a wide range of heavy-duty machines. Whether it's powering a water pump, generator, cultivator, pressure washer, or small construction equipment, this engine is built to work hard, day in and day out.\nWith a focus on durability, easy operation, and smart protection features, this engine offers the perfect balance of strength, efficiency, and reliability."
        },
        {
            "title": "Key Features",
            "description": "1. OHV Engine Technology:\nEquipped with advanced Overhead Valve (OHV) technology, the engine offers smoother performance, efficient fuel consumption, and lower emissions. This design ensures quick starts, reduced heat build-up, and improved torque — even in tough working environments.\n2. Heavy-Duty Application:\nThe Bonhoeffer Gasoline Engine is designed for high-load, extended-use applications. It is compatible with:\nWater pumps,Portable generators,Cultivators and tillers,Stationary sprayers,Pressure washers and Small-scale construction machinery.\nIts robust structure and steady power delivery make it ideal for both mobile and stationary equipment across industrial, agricultural, and utility sectors.\n3. Smart Framed Structure:\nThe engine features a compact but rugged frame that offers stability during operation and protects internal components from external damage. Its design also simplifies installation, making it suitable for integration across various machine platforms.\n4. Built-in Oil Sensor Protection:\nFor added safety and durability, the engine includes a low oil level sensor. This feature automatically shuts off the engine or prevents startup if the oil level drops below safe limits — helping prevent damage and prolong engine life.\n5. Steel Muffler Grille with Enhanced Cooling:\nA protective steel grille covers the muffler, adding durability and shielding it from debris or impact. In addition, this design enhances airflow and cooling efficiency, especially during long operating periods in hot or dusty environments." 
        },
        {
            "title": "Performance & Usability",
            "description": "Reliable Starting: Easy manual start system, designed for quick ignition even in cold or variable conditions.\nLow Maintenance: Engine components are engineered for longevity, with minimal service requirements.\nFuel Efficiency: Delivers high output without excessive fuel consumption, making it cost-effective for regular use.\nLow Vibration & Noise: Operates with reduced vibration for smoother use and better operator comfort."
        },
        {
            "title": "Applications",
            "description": "The Bonhoeffer Gasoline Engine is ideal for:\nAgricultural equipment,Light construction tools,Industrial sprayers and washers,Emergency power systems and Portable utility machines.\nIts versatility makes it a go-to solution for professionals who need dependable power across multiple use cases."
        },
        {
            "title": "Summary",
            "description": "The Bonhoeffer Gasoline Engine is a powerful and durable solution for anyone needing a compact, fuel-efficient engine capable of handling demanding jobs. With OHV technology, integrated protection features, and a structure built for the real world, it offers performance you can count on — whether in the field, on-site, or off the grid."
        }
    ],
    "gasoline-water-pump": [
        {
            "title": "Because When the Job's Tough, You Need Something Tougher",
            "description": "There's nothing quite like being caught in the middle of a job and realizing your equipment just can't keep up. Whether you're knee-deep in muddy water at a construction site, racing to water your crops before the heat sets in, or trying to clear out a flooded basement before damage sets in — you need gear you can trust.\nThat's exactly where the Bonhoeffer Gasoline Water Pump comes in.\nBuilt for people who work hard and don't have time for failure, this machine is designed to move water fast, reliably, and without any drama. No fancy bells and whistles — just a solid, powerful pump that shows up, starts up, and gets to work."
        },
        {
            "title": "A Powerful Engine That Just Keeps Going",
            "description": "At the heart of this pump is a rugged OHV engine that delivers consistent performance, even in the toughest conditions. It's quick to start — which matters when time's against you — and runs smoothly for hours. Whether you're out in the field with no access to electricity or working late into the evening, this engine keeps powering through.\nIt doesn't waste fuel, either. It's efficient, dependable, and made to handle jobs big and small without breaking a sweat."
        },
        {
            "title": "Surprisingly Portable, Seriously Tough",
            "description": "You might expect something this strong to be bulky and hard to move. It's not. Thanks to its lightweight aluminum pump housing, this machine is easy to carry, load into a truck, or haul across a job site. One person can handle it — no extra hands needed.\nAt the same time, the aluminum body means you don't have to worry about rust or weather damage. It holds up well, rain or shine, and shrugs off the wear and tear of daily use."
        },
        {
            "title": "Made for Dirty Water and Dirty Jobs",
            "description": "Let's be honest — water on job sites is rarely clean. That's why we designed this pump with a ceramic cylinder that resists wear and a double forged crankshaft arm to keep things running smoothly, even when debris tries to slow you down.\nThe whole system is built to last — fewer breakdowns, less maintenance, and more time getting the job done."
        },
        {
            "title": "Comfort You'll Notice",
            "description": "If you've ever used a water pump that rattles your arms for hours, you'll love the low-vibration design on this one. It's smooth, quiet, and easy on your hands — even during long sessions. Small touches like that make a big difference when the work piles up."
        },
        {
            "title": "Who It's For",
            "description": "Farmers needing fast, portable irrigation\nBuilders and contractors clearing water on site\nHomeowners dealing with basement flooding\nDisaster response teams who need fast, mobile water removal\nAnyone working where there's no power outlet in sight"
        },
        {
            "title": "Simple. Reliable. Ready When You Are.",
            "description": "We didn't overthink it. We just built it right. The Bonhoeffer Gasoline Water Pump is for the doers — the folks who show up early, stay late, and never let a challenge slow them down.\nIf that sounds like you, then this is your pump.\nYou bring the grit. We bring the gear."
        }
    ],
    "gasoline-generator": [
  {
    "title": "Bonhoeffer Gasoline Generators — Power That Follows You Anywhere",
    "description": "Imagine this: the lights flicker, the tools go silent, and everything comes to a standstill. Whether you're out on a farm, halfway through a job at a remote site, or simply trying to keep the house running during a sudden blackout — power matters. And when it matters, you don’t want to take chances.\nThat’s why there’s Bonhoeffer.\nOur gasoline generators aren’t just backup equipment. They’re your power partner — rugged, reliable, and always ready to step up when everything else shuts down."
  },
  {
    "title": "Built Tough. Runs Smooth.",
    "description": "What makes Bonhoeffer stand apart? It starts with the engine — a professional-grade gasoline engine that’s as steady as they come. It fires up easily, keeps its cool under load, and runs like a workhorse, hour after hour. Whether you’re powering drills, lights, pumps, or the essentials in your home, this generator won’t skip a beat.\nAnd because performance is only as good as the parts behind it, we don’t cut corners. 100% copper winding alternators ensure superior efficiency, consistent voltage output, and long-lasting durability. You get stable, clean power — the kind your equipment (and your peace of mind) depends on."
  },
  {
    "title": "Steel Frame, Built Like a Tank",
    "description": "Out in the real world, conditions aren’t always gentle. That’s why our generators are housed in tough, Q235-grade steel frames — the kind used in construction and industrial applications. Welded using automated robotic technology, these frames offer precision strength and stability. No rattles. No wobbles. Just a solid foundation that holds up — no matter where you take it."
  },
  {
    "title": "Control at Your Fingertips",
    "description": "No one wants to fumble with confusing buttons when the lights are out. That’s why Bonhoeffer’s integrated graphical control panel is designed to be effortless. Everything is laid out clearly — voltage indicators, power outlets, fuel status — so you can operate it confidently, even if it’s your first time using a generator."
  },
  {
    "title": "Handles Everything You Throw at It",
    "description": "Heavy tools? Household appliances? Emergency lighting systems? Bonhoeffer handles them all. These generators are built for varied load conditions, with inbuilt automatic voltage regulation (AVR) and overload protection, keeping both your devices and the generator safe.\nSo whether you're powering a workshop or keeping the fridge and fans running during a summer power cut, it adapts and delivers without hesitation."
  },
  {
    "title": "Safety Comes Standard",
    "description": "Every Bonhoeffer generator is equipped with essential safety features:\n- Low oil sensors to prevent engine damage\n- Thermal overload protection\n- Secure grounding and shielded mufflers for added safety\nThese aren’t optional — they’re part of the promise that your power will always be safe, smart, and dependable."
  },
  {
    "title": "Portable Power, No Strings Attached",
    "description": "You don’t stay in one place — and neither should your generator. Bonhoeffer models are compact, easy to store, and available with wheel kits and foldable handles for easy transport. From home to field to workshop, your power goes wherever you go."
  },
  {
    "title": "The Bottom Line?",
    "description": "When you choose Bonhoeffer, you’re not just buying a generator.\nYou’re investing in confidence — that when the lights go out, your world keeps moving.\nYou’re choosing control — power that’s yours, anywhere, anytime.\nYou’re getting performance — smart engineering, sturdy construction, and no-nonsense reliability.\nBonhoeffer Gasoline Generators — Because when power is non-negotiable, you deserve one that won’t let you down."
  }
],
    "gasoline-inverter": [
  {
    "title": "Gasoline Inverter — Quiet, Portable Power with a Purpose",
    "description": "Picture this: you’re off the grid, the night is quiet, and your equipment needs power. Or perhaps it’s a sudden power outage at home, and everything from your phone to your fridge is down. That’s when every second matters — and every watt counts.\nThat’s when the Bonhoeffer Gasoline Inverter steps in.\nMore than just a power source, it’s your quiet companion — engineered for performance, built for movement, and trusted when silence and stability matter most."
  },
  {
    "title": "Whisper-Quiet. Fully Capable.",
    "description": "One of the most noticeable things about Bonhoeffer’s inverter is what you don’t notice — the noise. Designed with ultra-quiet technology, it hums in the background without disrupting conversations, sleep, or the sounds of nature. Perfect for homes, campsites, workstations, and anywhere silence is golden.\nIts core is a 4-stroke gasoline engine, known for smooth running and fuel efficiency. It starts easily, stays cool under pressure, and runs clean — producing stable power safe enough for sensitive electronics like laptops, routers, cameras, and medical equipment."
  },
  {
    "title": "Built for Real-World Conditions",
    "description": "The Bonhoeffer inverter isn’t just about indoor convenience — it’s made for the outdoors, too. With performance guaranteed across a wide temperature range (-5°C to 50°C), it works just as well in freezing hillsides as it does in blazing summer heat.\nUneven ground? No worries. Thanks to its 25° tilt tolerance in all directions, the inverter keeps running even when placed on sloped surfaces, gravel patches, or uneven terrain."
  },
  {
    "title": "Power That Moves With You",
    "description": "Designed with portability at its core, this inverter is lightweight, compact, and easy to carry. The use of high-quality plastic resin body components cuts down weight without compromising durability. Whether you’re moving it around the garden, loading it in a car, or packing it for an off-grid adventure — it travels light and works hard.\nOptional wheel kits and folding handles make transport even more effortless."
  },
  {
    "title": "Efficiency You Can Count On",
    "description": "Every drop of fuel counts, and Bonhoeffer ensures you get the most out of it. The inverter is built to make full use of petrol, extending runtime and reducing refills. This fuel-smart design means you stay powered longer, especially when fuel access is limited or you’re away from civilization."
  },
  {
    "title": "Safe. Simple. Smart.",
    "description": "Operating the Bonhoeffer inverter is easy, even for first-time users. The user-friendly control panel displays all vital stats clearly — power output, fuel level, and system alerts — so you stay in control with just a glance.\nSafety is part of the system. The inverter includes:\n- Overload protection to guard your devices\n- Low oil shutdown to protect the engine\n- Heat-resistant design for extended operation\nThese features work quietly in the background, ensuring safety without adding complexity."
  },
  {
    "title": "The Bonhoeffer Promise",
    "description": "When you choose a Bonhoeffer Gasoline Inverter, you’re choosing more than just portable electricity.\nYou’re choosing quiet confidence — power that performs without the noise.\nYou’re choosing mobility — energy that goes where you go.\nYou’re choosing engineering that endures — crafted for real-world use, not just perfect conditions.\nBonhoeffer Gasoline Inverter — For Power That Never Feels Like a Burden.\nBecause when the world goes dark, this is the light, the charge, and the quiet force you can rely on."
  }
]



}
