{
    "gasoline-engine": [
        {
            "title": "High-Performance Power for Demanding Applications",
            "description": "The Bonhoeffer Gasoline Engine is engineered to deliver consistent, high-performance output for a wide range of heavy-duty machines. Whether it's powering a water pump, generator, cultivator, pressure washer, or small construction equipment, this engine is built to work hard, day in and day out.\nWith a focus on durability, easy operation, and smart protection features, this engine offers the perfect balance of strength, efficiency, and reliability."
        },
        {
            "title": "Key Features",
            "description": "1. OHV Engine Technology:\nEquipped with advanced Overhead Valve (OHV) technology, the engine offers smoother performance, efficient fuel consumption, and lower emissions. This design ensures quick starts, reduced heat build-up, and improved torque — even in tough working environments.\n2. Heavy-Duty Application:\nThe Bonhoeffer Gasoline Engine is designed for high-load, extended-use applications. It is compatible with:\nWater pumps,Portable generators,Cultivators and tillers,Stationary sprayers,Pressure washers and Small-scale construction machinery.\nIts robust structure and steady power delivery make it ideal for both mobile and stationary equipment across industrial, agricultural, and utility sectors.\n3. Smart Framed Structure:\nThe engine features a compact but rugged frame that offers stability during operation and protects internal components from external damage. Its design also simplifies installation, making it suitable for integration across various machine platforms.\n4. Built-in Oil Sensor Protection:\nFor added safety and durability, the engine includes a low oil level sensor. This feature automatically shuts off the engine or prevents startup if the oil level drops below safe limits — helping prevent damage and prolong engine life.\n5. Steel Muffler Grille with Enhanced Cooling:\nA protective steel grille covers the muffler, adding durability and shielding it from debris or impact. In addition, this design enhances airflow and cooling efficiency, especially during long operating periods in hot or dusty environments." 
        },
        {
            "title": "Performance & Usability",
            "description": "Reliable Starting: Easy manual start system, designed for quick ignition even in cold or variable conditions.\nLow Maintenance: Engine components are engineered for longevity, with minimal service requirements.\nFuel Efficiency: Delivers high output without excessive fuel consumption, making it cost-effective for regular use.\nLow Vibration & Noise: Operates with reduced vibration for smoother use and better operator comfort."
        },
        {
            "title": "Applications",
            "description": "The Bonhoeffer Gasoline Engine is ideal for:\nAgricultural equipment,Light construction tools,Industrial sprayers and washers,Emergency power systems and Portable utility machines.\nIts versatility makes it a go-to solution for professionals who need dependable power across multiple use cases."
        },
        {
            "title": "Summary",
            "description": "The Bonhoeffer Gasoline Engine is a powerful and durable solution for anyone needing a compact, fuel-efficient engine capable of handling demanding jobs. With OHV technology, integrated protection features, and a structure built for the real world, it offers performance you can count on — whether in the field, on-site, or off the grid."
        }
    ],
    "gasoline-water-pump": [
        {
            "title": "Because When the Job's Tough, You Need Something Tougher",
            "description": "There's nothing quite like being caught in the middle of a job and realizing your equipment just can't keep up. Whether you're knee-deep in muddy water at a construction site, racing to water your crops before the heat sets in, or trying to clear out a flooded basement before damage sets in — you need gear you can trust.\nThat's exactly where the Bonhoeffer Gasoline Water Pump comes in.\nBuilt for people who work hard and don't have time for failure, this machine is designed to move water fast, reliably, and without any drama. No fancy bells and whistles — just a solid, powerful pump that shows up, starts up, and gets to work."
        },
        {
            "title": "A Powerful Engine That Just Keeps Going",
            "description": "At the heart of this pump is a rugged OHV engine that delivers consistent performance, even in the toughest conditions. It's quick to start — which matters when time's against you — and runs smoothly for hours. Whether you're out in the field with no access to electricity or working late into the evening, this engine keeps powering through.\nIt doesn't waste fuel, either. It's efficient, dependable, and made to handle jobs big and small without breaking a sweat."
        },
        {
            "title": "Surprisingly Portable, Seriously Tough",
            "description": "You might expect something this strong to be bulky and hard to move. It's not. Thanks to its lightweight aluminum pump housing, this machine is easy to carry, load into a truck, or haul across a job site. One person can handle it — no extra hands needed.\nAt the same time, the aluminum body means you don't have to worry about rust or weather damage. It holds up well, rain or shine, and shrugs off the wear and tear of daily use."
        },
        {
            "title": "Made for Dirty Water and Dirty Jobs",
            "description": "Let's be honest — water on job sites is rarely clean. That's why we designed this pump with a ceramic cylinder that resists wear and a double forged crankshaft arm to keep things running smoothly, even when debris tries to slow you down.\nThe whole system is built to last — fewer breakdowns, less maintenance, and more time getting the job done."
        },
        {
            "title": "Comfort You'll Notice",
            "description": "If you've ever used a water pump that rattles your arms for hours, you'll love the low-vibration design on this one. It's smooth, quiet, and easy on your hands — even during long sessions. Small touches like that make a big difference when the work piles up."
        },
        {
            "title": "Who It's For",
            "description": "Farmers needing fast, portable irrigation\nBuilders and contractors clearing water on site\nHomeowners dealing with basement flooding\nDisaster response teams who need fast, mobile water removal\nAnyone working where there's no power outlet in sight"
        },
        {
            "title": "Simple. Reliable. Ready When You Are.",
            "description": "We didn't overthink it. We just built it right. The Bonhoeffer Gasoline Water Pump is for the doers — the folks who show up early, stay late, and never let a challenge slow them down.\nIf that sounds like you, then this is your pump.\nYou bring the grit. We bring the gear."
        }
    ]

}